{
    "categories": {
        "world": "World History",
        "characters": "Characters",
        "creatures": "Bestiary",
        "locations": "Locations",
        "items": "Artifacts & Items"
    },
    "entries": [
        {
            "id": "lore_ch1_intro",
            "category": "world",
            "title": "The Shattered Aegis",
            "chapter": 1,
            "content": "For centuries, the Aegis has protected our world from forces beyond comprehension. An invisible barrier woven from resonance energy, it keeps at bay the Echo Primordial—an entity from before creation itself. Now, the Aegis falters. Tremors shake the earth, and a crystalline corruption seeps from the depths. The time has come for a new champion to rise."
        },
        {
            "id": "lore_ch1_hearthwell",
            "category": "locations",
            "title": "Hearthwell Village",
            "chapter": 1,
            "content": "A quiet mining town built around an ancient Watchtower, Hearthwell has prospered for generations by extracting ore from the rich veins beneath the earth. The townsfolk are hardy and practical, led by Elder Malik who serves as both mayor and lorekeeper. Few know that the Watchtower was once a research facility for the Resonance Keepers."
        },
        {
            "id": "lore_ch1_echo_corruption",
            "category": "world",
            "title": "The Echo",
            "chapter": 1,
            "content": "The corruption spreading through Hearthwell is known as the Echo—a crystalline infection that transforms organic matter into conduits for an alien will. Those touched by the Echo hear whispers in frequencies beyond normal perception. Extended exposure leads to crystalline growths, loss of identity, and eventual absorption into a greater consciousness."
        },
        {
            "id": "lore_ch1_echo_mites",
            "category": "creatures",
            "title": "Echo Mites",
            "chapter": 1,
            "content": "Small crystalline parasites that feed on resonance energy. Echo Mites are not truly alive in any conventional sense—each one is a fragment of the Echo Primordial's dreaming will given physical form. They seek sources of magical energy and will swarm living creatures to drain their life force. Their crystalline shells make them resistant to mundane weapons."
        },
        {
            "id": "lore_ch1_echo_shards",
            "category": "items",
            "title": "Echo Shards",
            "chapter": 1,
            "content": "Fragments of crystallized Echo corruption, these shards pulse with an inner violet light. Blacksmith Brond has discovered they vibrate at specific frequencies when exposed to heat—frequencies that may correspond to the original Aegis harmonics. Handling them for extended periods is not recommended."
        },
        {
            "id": "lore_ch1_resonance_frequency",
            "category": "world",
            "title": "Resonance Frequencies",
            "chapter": 1,
            "content": "All matter vibrates at specific frequencies, but resonance energy operates on harmonics beyond normal perception. The Resonance Keepers learned to manipulate these frequencies, creating the Aegis by harmonizing the world itself into a barrier. The Echo represents a discordant frequency—one that seeks to overwrite our reality's fundamental song."
        },
        {
            "id": "lore_ch1_resonance_keepers",
            "category": "characters",
            "title": "The Resonance Keepers",
            "chapter": 1,
            "content": "An ancient order of scholars and mages who first discovered the Echo Primordial's intrusion into our world. Rather than fight what could not be destroyed, they devised the Aegis—a seal that would keep the Primordial dormant. To power this seal, the Keepers sacrificed their mortal existence, becoming eternal wardens bound to the barrier they created."
        },
        {
            "id": "lore_ch1_town_wards",
            "category": "locations",
            "title": "Hearthwell's Wards",
            "chapter": 1,
            "content": "Mage Elara maintains a network of protective wards around Hearthwell, inherited from the town's founders. These wards are connected to the central obelisk and draw power from the same resonance frequencies as the Aegis itself. The recent instability has caused mana leaks at several nodes, attracting Echo creatures to the town's perimeter."
        },
        {
            "id": "lore_ch1_undermines",
            "category": "locations",
            "title": "The Undermines",
            "chapter": 1,
            "content": "The mining tunnels beneath Hearthwell extend far deeper than most realize. Ancient passages predate the town by millennia, carved by unknown hands. The miners avoid these old sections, speaking of strange echoes and lights in the deep. Now, with the corruption spreading, the Undermines have become a gateway for the Echo's influence."
        },
        {
            "id": "lore_ch1_echo_rats",
            "category": "creatures",
            "title": "Echo Rats",
            "chapter": 1,
            "content": "Once ordinary mine rats, these creatures have been transformed by prolonged Echo exposure. Crystalline growths sprout from their bodies, and their eyes glow with alien awareness. They move in coordinated packs, sharing a hive consciousness that makes them far more dangerous than their mundane cousins. Their bite can transmit Echo corruption."
        },
        {
            "id": "lore_ch1_lost_miners",
            "category": "characters",
            "title": "The Lost Miners",
            "chapter": 1,
            "content": "When the tremors began, a crew of twelve miners was working the deep shafts. Only three escaped to tell of crystalline growths bursting from the walls and their colleagues being... changed. The rest remain below, their fate unknown. Some say they can still hear their voices echoing up from the depths, singing in alien harmonies."
        },
        {
            "id": "lore_ch1_echo_crystals",
            "category": "items",
            "title": "Echo Crystals",
            "chapter": 1,
            "content": "Larger and more stable than Echo Shards, these crystals form at nodes of concentrated corruption. They store resonance energy and can be used to power magical constructs—or, in the wrong hands, to amplify the Echo's influence. The Blacksmith believes they may hold the key to understanding the corruption's origin."
        },
        {
            "id": "lore_ch1_echo_beholder",
            "category": "creatures",
            "title": "The Echo Beholder",
            "chapter": 1,
            "content": "A massive creature that has nested near the deepest breach, the Echo Beholder is a being of pure crystalline corruption given monstrous form. Its many eyes perceive across multiple frequencies, and it can project beams of dissonant energy that destabilize matter itself. It guards the first fragment needed to restore the Aegis—the Shard of Resonance."
        },
        {
            "id": "lore_ch1_shard_resonance",
            "category": "items",
            "title": "Shard of Resonance",
            "chapter": 1,
            "content": "The first of the Aegis fragments, recovered from the Echo Beholder's nest. This shard pulses with a frequency that harmonizes with the town's ancient obelisk. It represents the fundamental principle of the Aegis: that all things can be brought into harmony. Yet claiming it has weakened the Primordial's prison. Each shard recovered brings both hope and danger."
        },
        {
            "id": "lore_ch1_aegis_history",
            "category": "world",
            "title": "The Aegis Creation",
            "chapter": 1,
            "content": "Elder Malik reveals what few know: the Aegis was never meant to be permanent. It was a seal, placed over a wound in reality where the Echo Primordial first pushed through from... elsewhere. The Resonance Keepers knew it would eventually fail. They left behind the shards as keys, hoping future generations would find a way to forge a new, permanent barrier."
        },
        {
            "id": "lore_ch1_obelisk",
            "category": "locations",
            "title": "The Ancient Obelisk",
            "chapter": 1,
            "content": "At Hearthwell's center stands an obelisk of unknown origin, carved with symbols no living scholar can fully decipher. It predates the town, the Watchtower, even the Undermines. The Resonance Keepers built their research facility around it, recognizing it as a focal point for resonance energy. Today, it serves as the anchor for the town's protective wards."
        },
        {
            "id": "lore_ch1_backlash",
            "category": "world",
            "title": "Obelisk Backlash",
            "chapter": 1,
            "content": "Activating the obelisk with the Shard of Resonance triggered an unexpected release of energy. The accumulated corruption in the area was violently expelled, but the process drew the attention of entities that should not have noticed. The Echo constructs that emerged are manifestations of the Primordial's defensive instincts—proof that something ancient is beginning to stir."
        },
        {
            "id": "lore_ch1_echo_warning",
            "category": "world",
            "title": "The Primordial Stirs",
            "chapter": 1,
            "content": "The constructs' coordinated attack reveals a disturbing truth: the Echo Primordial is not merely a force of corruption, but a conscious entity. Each shard recovered weakens its prison, and it knows you are coming. Elder Malik warns that the path ahead will only grow more dangerous. The choice to continue forward is yours alone to make."
        },
        {
            "id": "lore_ch1_attunement",
            "category": "world",
            "title": "Resonance Attunement",
            "chapter": 1,
            "content": "Your exposure to the Shard of Resonance has changed you. You can now perceive frequencies invisible to others—the subtle harmonics that underlie all reality. This attunement marks you as a potential successor to the Resonance Keepers. Whether this is a gift or a curse remains to be seen."
        },
        {
            "id": "lore_ch1_finale",
            "category": "world",
            "title": "Chapter 1 Complete",
            "chapter": 1,
            "content": "The first shard is secured, and Hearthwell is safe—for now. But the tremors continue beyond the town's borders, and reports speak of corruption spreading through the forests to the east. The Echo's influence grows with each passing day. You have proven yourself in the depths below; now the wider world calls. The hunt for the remaining shards begins."
        },
        {
            "id": "lore_world_geography",
            "category": "locations",
            "title": "The Known World",
            "chapter": 0,
            "content": "Beyond Hearthwell lies a realm of diverse landscapes: the Thornveil Forest to the east, the Miremoor Marshlands to the south, and the Glassfield Plateau to the north. Each region holds secrets from the age of the Resonance Keepers, and each may contain fragments of the shattered Aegis. Your journey has only begun."
        }
    ]
}